{
	"2.6.530": {
		"type": "release",
		"release-date": "2024-10-24T16:43:00+02:00",
		"download-link": "https://www.dropbox.com/scl/fo/ngb9r6wa1t97u42nenp7n/h?rlkey=cd0s72516hbmsbmfkc2te4kdp&st=jirh9cym&dl=0",
		"changelog": "# Release 2.6\n\n## Disclaimer\n\nThis release is not state-compatible with previous software versions; configuration scripts need to be adapted and will need to be reapplied.\n\n## New Features\n**vscriptd** Permit uploads to the persistent /config partition (meant for auto-starting user plugins)\n\n**AT300** Add 3 new JPEG-XS application images with 16 JPEG-XS TX/RX instances in total (16/0, 0/16 or 8/8)\n\n**RTPReceiver** Add Unicast support\n\n**AT300** (beta) Audio mixer and virtual panel UI\n\n**NMOS** added an option to prefix senders and receivers with their respective media type\n\n**Matrix** added preliminary support for Unicast transmission\n\n**syslog** added support for ISO8601 date format\n\n**Webserver** When using KTLS, bypass OpenSSL once a connection has been established to restore wss interoperability with some clients\n\n**AT300** Assert SFF/page 0/byte 93/bit 2 to improve compatibility with Power Class 5-7 modules\n\n**AT300** Updated I/O module firmware (includes AT300-specific optimizations)\n\n**ALL** A new service \"vscriptd\" allows for user scripts to be executed on the blade. The current version is not yet feature-complete and has not been thoroughly tested, and is thus disabled by default. To enable it, set system.services.vscriptd to true\n\n**AVP/AT300** There is now full support for 6G UHD standards, including SDI I/O\n\n**ALL** (pre-release) REST API allows easy access to single parameters\n\n**GUI** (live view) added interval to check for lazy thumbnails\n\n**GUI** (ppms) changed behaviour of dropdown; showing channel group selection even if channels are empty\n\n**GUI** (flows) Rx/Tx Wizards now have selection for creation of multiple video/audio tx/rx\n\n**GUI** (flows) Selecting inputs without outputs will now assign null as source\n\n**GUI** Pausing some processing and rendering while tab is inactive to reduce cpu/gpu utilization\n\n**GUI** Added entries in menu; added build_info and number of active_connections to about section\n\n**GUI** Added /active_licenses.json in licenses section\n\n**GUI** Searchable dropdown lists should behave correct now, now closing when clicking outside of opened dropdown\n\n**GUI** Moved all download links to burger menu\n\n**GUI** (ip address)(ip setup) Fixed bug where adding rows deleted form values\n\n**GUI** (ip address)(ip setup) Added description to leave gateway bytes to \"0.0.0.0\" to apply default gateway\n\n**GUI** (ip address)(ip setup) Fixed bug where an undefined value in the \"weight\" (or from 2.7 \"metric\") field was interpreted as number 0\n\n**GUI** (nmos setup) Fixed bug where changes were not applied to persistent config\n\n**GUI** (flows) Added option to show routes from outputs to inputs\n\n**GUI** (flows) Added list filters\n\n**GUI** (flows) Added traffic information for audio/video receivers/transmitters on right-click\n\n**GUI** (flows)(beta - !work in progress!) Added wizards to create multiple transmitter/receiver sessions with fixed number of video/audio transmitters/receivers\n\n**GUI** (flows)(wizards) Added audio-only option for RTP Receivers\n\n**GUI** (flows)(external sdp) Fixed showing number of video/audio transmitters in list; fixed showing row_name\n\n**GUI** (players/delays) upload of png files can now specify the exact standard (if supported) in the file name. E.g. \"mystill_HD1080i50.png\"\n\n## Changes/Enhancements/Bug fixes\n\n**Matrix** TX JPEG_XS license management\n\n**Matrix** Don't restart video signal generator (VSG) when the active standard is written again\n\n**Matrix** Restart the VSG when `t_src` is changed\n\n**Matrix** Make SDI input debouncing configurable (except for phy lock changes), add change counters for both `output.standard` and `hw_status.standard`\n\n**RTPReceiver** Fix potential JPEG-XS timing bug at read delays < 1 frame\n\n**CC3D** Bundle NBCU LUTs\n\n**RTPTransmitter/Matrix** Fix crossbar bug that could cause \"mild\" stream corruption for >3G streams (where 50% of the packets would be time-shifted relative to the other half by one frame)\n\n**RTPTransmitter** Fix bug that would have SPS transmitters use different SSRCs on their two network paths\n\n**RTPReceiver** Fix control issue that made it difficult to get rid of incorrect, stream-shared SDPs\n\n**RTPReceiver** Don't crash on reboot if there is an unconfigured ancburst receiver\n\n**AT300/JPEGXS_TX** fixed FCnt in JpegXS header in interlaced standards incrementing at the wrong time\n\n**NMOS** Acknowledge SDP requests upon accepting the SDP instead of upon\nvideo-reception. This would lead to request timing out in case of network\nmalfunction.\n\n**NMOS** delay 200-204 http-responses on \"activate_immediate\" requests to\nsenders until request-completion\n\n**vapi** permit .write(...) calls to explicitly skip validation (whereas previously this would require a pointless always-true validator, and wait for at least one response)\n\n**RTPReceiver** fix SDP parsing issue that would cause flows to be misidentified as having a color depth of only 8 bits\n\n**SampleRateConverter/AT1130** fix recently introduced channel duplication issue\n\n**SDI Inputs/AT1130** fix async audio deembedding issue when running with 3G/UHD standards\n\n**RTPReceiver** permit shorter minimum read delays (relies on the TP= parameter, so having this parameter set correctly may not be relevant in some cases, whereas previously it would always be ignored)\n\n**PTP** provide more details on discarded sync/delay messages to help with PTP debugging\n\n**RTPReceiver** fix an issue where multiple receiver sharing the same (incorrect) SDP could only be relieved of their misery by sending a correct SDP multiple times; this should no longer be necessary (when running in Patch mode)\n\n**Matrix** robustly handle lost BNC input interrupts\n\n**RTPReceiver** fix an issue where audio receivers running in servo mode would reserve more hardware resources than required\n\n**NMOS** always set \"rtp_enabled\" on receiver transport parameters\n\n**JPEGXS** 6G SDI bugfixes\n\n**PTP** Fix GPGGA parser bug that would render GPS inputs inoperable at negative geoid heights (which includes about half of the world, but unfortunately not our company offices)\n\n**TimeFlows** don't have combinators advertise oversized drift/error estimates if `min_drift_tolerance` of `min_offset_tolerance` are large\n\n**SampleRateConverter** Fixed a bug that could prevent SRC instances from\nbeing routable to audio shufflers\n\n**SampleRateConverter** Fixed a bug that could interfere with channel capacity\nconfiguration\n\n**Advanced/Debug UI** Fix bug in reference selector where table entries would not be shown unless table[0] was allocated\n\n**vscript/vapi** Previously, towels would not be cleared on a close() call directly preceded by reboot()\n\n**RTPTransmitter** Advertise estimated video stream bandwidths using b=AS:([0-9+]) lines\n\n**IPA** Fix signal corruption issue in compressor\n\n**IPA** Fix bug in loudness computation\n\n**GUI** (flows) fixed bugs where creation/deletion of some sources/destination were not recognized\n\n## Overview\n\n**AT300/AVP_100GbE** 36x RTPVidTx, 32x RTPVidRx, 511x RTPAudTx, 256x RTPAudRx, 32x RTPAnc/BurstRx, 24x ColCorr (12x 3D-LUT based), 24x VidMix/Key, 16x VidRePlay, 128x AudRePlay, AudioGain, 3x 384 AudioSRCs, 563x AudioShuffler, 20x VC2Enc, 32x VC2Dec, 2x LTCGen, 3x VidGenlock, 3x AudGenlock, 2x VidSignalGen, AudioSignalGen silence/400Hz/440Hz/1kHz, 3x MasterClock LTC-Gen, 16x Audio N-Minus-1, 64x AudioMixer, 256x LoudnessMetering\n\n**AT300/JPEGXS_RX_100GbE** 32x RTPVidRX, 8x JPEGXSDec, 16x VC2Dec, 30x RTPVidTx ...\n\n**AT300/JPEGXS_TX_100GbE** 30x RTPVidTx. 8x JPEGXSEnc, 32x RTPVidRx, 32x VC2Dec ...\n\nRelease 2.6 supports **C100  AVP / AVP_40GbE / CC3D_40GbE / JPEGXS_40GbE / PCAP_40GbE / UDX_40GbE\n\nFor a detailed list of hardware capabilities, please load the application you wish to use and refer to http://<ip-address-of-your-AT300>/runtime_constants.json\n"
	}
}
